#### SolidglassTransmittanceType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "SolidglassTransmittance" from the "SolidGlass" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum SolidglassTransmittanceType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SolidglassTransmittanceType ``` |

| Visual C++ |
| --- |
| ``` public enum class SolidglassTransmittanceType ``` |

# Members

| Member name | Description |
| --- | --- |
| Clear |  |
| Green |  |
| Gray |  |
| Blue |  |
| Bluegreen |  |
| Bronze |  |
| CustomColor |  |

# See Also

Autodesk.Revit.DB.Visual Namespace